import os, pprint
import pyarabic

language = "English"
ref = {}

if (language == "English"):
    ref = {
        "a": 0,
        "b": 1,
        "c": 2,
        "d": 3,
        "e": 4,
        "f": 5,
        "g": 6,
        "h": 7,
        "i": 8,
        "j": 9,
        "k": 10,
        "l": 11,
        "m": 12,
        "n": 13,
        "o": 14,
        "p": 15,
        "q": 16,
        "r": 17,
        "s": 18,
        "t": 19,
        "u": 20,
        "v": 21,
        "w": 22,
        "x": 23,
        "y": 24,
        "z": 25,
        "A": 26,
        "B": 27,
        "C": 28,
        "D": 29,
        "E": 30,
        "F": 31,
        "G": 32,
        "H": 33,
        "I": 34,
        "J": 35,
        "K": 36,
        "L": 37,
        "M": 38,
        "N": 39,
        "O": 40,
        "P": 41,
        "Q": 42,
        "R": 43,
        "S": 44,
        "T": 45,
        "U": 46,
        "V": 47,
        "W": 48,
        "X": 49,
        "Y": 50,
        "Z": 51,
        " ": 52
    }
elif language == "Arabic":
    ref = {
        "ا": 0,
        "ب": 1,
        "ت": 2,
        "ث": 3,
        "ج": 4,
        "ح": 5,
        "خ": 6,
        "د": 7,
        "ذ": 8,
        "ر": 9,
        "ز": 10,
        "س": 11,
        "ش": 12,
        "ص": 13,
        "ض": 14,
        "ط": 15,
        "ظ": 16,
        "ع": 17,
        "غ": 18,
        "ف": 19,
        "ق": 20,
        "ك": 21,
        "ل": 22,
        "م": 23,
        "ن": 24,
        "ه": 25, # cool looking one
        "و": 26,
        "ي": 27,
        "ء": 28 # end of first
    }

sentence = "How does this work"
b = [ref[s] for s in sentence]
print(b)